app/views/incidents/index.html.erb


<% if Incident.count != 0 %>
---
SELECT COUNT(*) FROM "incidents"

	<% if current_user.admin == "yes" %>
	<td><%= User.find(incident.user_id).profile.name %> (<%= User.find(incident.user_id).profile.department %>)</td>
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 16 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1