app/controllers/incidents_controller.rb

SELECT "incidents".* FROM "incidents" INNER JOIN "users" ON "users"."id" = "incidents"."user_id" INNER JOIN "profiles" ON "profiles"."user_id" = "users"."id" WHERE (department LIKE '%Admin%') ORDER BY id DESC LIMIT 10 OFFSET 0
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 16 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "incidents" INNER JOIN "users" ON "users"."id" = "incidents"."user_id" INNER JOIN "profiles" ON "profiles"."user_id" = "users"."id" WHERE (department LIKE '%Lexington%')
SELECT "incidents".* FROM "incidents" ORDER BY id DESC LIMIT 10 OFFSET 0
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "incidents"
---
  def index
    if current_user.admin == "yes"

    	#  if params[:user][:id]
    	#  @incidents = Incident.where("user_id = ?", params[:user][:id])
    	#  @users = User.all
    	#  else
      #  Bens code
      #  @incidents = Incident.all(:order => 'id DESC')


      # If an admin logs in
      # Fiters through each department
      if params[:search]
           @incidents = Incident.paginate(:page => params[:page], :per_page => 10, :order => 'id DESC').find(:all, :conditions => ['department LIKE ?', "%#{params[:search]}%"], :joins => [:user => :profile])
      # Search through specific column
      elsif params[:searchInvoice]
           @incidents = Incident.paginate(:page => params[:page], :per_page => 10, :order => 'id DESC').find(:all, :conditions => ['report_nr LIKE ?', "%#{params[:searchInvoice]}%"])
      # Display all with pagination
      else
           @incidents = Incident.paginate(:page => params[:page], :per_page => 10, :order => 'id DESC')

SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = $1 LIMIT 1  [["id", "1102"]]
---
  def show
    @incident = Incident.find(params[:id])

SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = $1 LIMIT 1  [["id", "1102"]]
---
  def edit
    @incident = Incident.find(params[:id])

SELECT "incidents".* FROM "incidents" WHERE "incidents"."id" = $1 LIMIT 1  [["id", "1102"]]
DELETE FROM "incidents" WHERE "incidents"."id" = $1  [["id", 1102]]
---
  def destroy
    if current_user.admin == "yes"
	    @incident = Incident.find(params[:id])
        @incident.destroy